<?php
date_default_timezone_set('Asia/Tokyo');
require 'vendor/autoload.php';
require './config.php';

/**
 * Generated by PHPUnit_SkeletonGenerator on 2014-10-07 at 18:11:53.
 */
class TeapotCtrlTest extends \PHPUnit_Framework_TestCase
{
    /**
     * Sets up the fixture, for example, opens a network connection.
     * This method is called before a test is executed.
     */
    protected function setUp()
    {
    }

    /**
     * Tears down the fixture, for example, closes a network connection.
     * This method is called after a test is executed.
     */
    protected function tearDown()
    {
    }

    function testExecute()
    {
      ini_set('xdebug.var_display_max_children', -1);
      ini_set('xdebug.var_display_max_data', -1);
      ini_set('xdebug.var_display_max_depth', -1);
      $ctrl = new \MyLib\TeapotCtrl('http://teapot-api.bodic.org/api/v1/sparql', 'http://teapot-api.bodic.org/api/v1/places');

      $ret = $ctrl->execute('select distinct * where {?s ?p ?o .  FILTER(!isBlank(?s)) } order by ?s LIMIT 1');
      $this->assertEquals(
          '{"resultCode":0,"errorMsg":null,"contents":{"head":{"vars":["s","p","o"]},"results":{"bindings":[{"s":{"type":"uri","value":"http:\/\/teapot.bodic.org\/dataset\/aedLocation"},"p":{"type":"uri","value":"http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http:\/\/teapot.bodic.org\/type\/dataset"}}]}}}',
          json_encode($ret),
          '正常の場合'
      );

      $ret = $ctrl->execute('x');
      $this->assertEquals(
          '{"resultCode":2,"errorMsg":"Error 400: Parse error: \nx\n\rLexical error at line 1, column 2.  Encountered: <EOF> after : \"\"\n\n\nFuseki - version 1.1.1 (Build date: 2014-10-02T16:36:17+0100)\n","contents":null}',
          json_encode($ret),
          '不正なクエリーの場合'
      );

      $ret = $ctrl->execute('select distinct * where {<http://teapot.bodic.org/facility/香椎高等学校9700716> ?p ?o FILTER(!isBlank(?o))} order by ?p ');

      $ctrl = new \MyLib\TeapotCtrl('http://teapot-api.bodic.org/api/v1/xxx', 'http://teapot-api.bodic.org/api/v1/places');
      $ret = $ctrl->execute('select distinct * where {?s ?p ?o .  FILTER(!isBlank(?s)) } order by ?s LIMIT 1');
      $this->assertEquals(
          '{"resultCode":1,"errorMsg":"ResponceCode: 404 Message:{\"@message\":\"The requested path is nowhere to be found on this server...\"}","contents":null}',
          json_encode($ret),
          'エンドポイントにつながらない場合'
      );
    }
}
